---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallNegativeHeight
source: html/c79e8900-c568-abfd-75e5-13f88b041313.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallNegativeHeight Property

The top of the Wall is lower than the base of the Wall.

## Syntax (C#)
```csharp
public static FailureDefinitionId WallNegativeHeight { get; }
```